app/Http/Controllers/CommentsController.php

    public function store(Request $request)
    {
        //
        $arr = $request->input();
        $comment = new Comment();
        $comment->content = $arr['content'];
        $id_serie = $arr['id_serie'];
        $serie = Serie::find($id_serie)->comments()->save($comment);
        $user = User::find(Auth::user())->comments()->save($comment);
---
insert into `comments` (`content`, `user_id`, `serie_id`, `updated_at`, `created_at`) values ('Nuevo Comm', 2, 1, '2021-03-15 02:53:51', '2021-03-15 02:53:51')

    public function destroy($id)
    {
        //
        $comment = Comment::find($id);
        $id_serie =  $comment->serie_id;
        $comment->delete();
---
delete from `comments` where `id` = 2