app/Http/Controllers/SeriesController.php

select * from `series`
---
    public function index(User $user)
    {


        $current_date_time = Carbon::now()->toDateTimeString();

        $hash = md5($current_date_time .'029df42137a1ad8105bcf66a208bc081efbf4559abae7768139eb68365c998fc37636a75');
        $response = Http::get('https://gateway.marvel.com:443/v1/public/comics?format=comic&formatType=comic&noVariants=true&limit=100&orderBy=title&ts='. $current_date_time . '&apikey=abae7768139eb68365c998fc37636a75&hash='. $hash)['data'];

    // $news = Http::get('https://newsapi.org/v2/everything?q=Marvel&from=2021-05-02&sortBy=popularity&apiKey=4bbe98577e3c479b86a2691323a56896');
        //dd($news["articles"]);
        return view('index', ['user' => $user])->with("series",$response);

select * from `comments` where `comments`.`serie_id` = 1 and `comments`.`serie_id` is not null
---
    public function show($id)
    {
        //
        $current_date_time = Carbon::now()->toDateTimeString();

        $hash = md5($current_date_time .'029df42137a1ad8105bcf66a208bc081efbf4559abae7768139eb68365c998fc37636a75');
        $response = Http::get('https://gateway.marvel.com:443/v1/public/comics/'. $id .'?&ts='. $current_date_time . '&apikey=abae7768139eb68365c998fc37636a75&hash='. $hash)['data'];
        //dd($response);

        try {
            $comments = Comment::where("id_comic","=", $id)->get();

            return view('series.comic', ['comments'=>$comments])->with("serie",$response["results"][0]);